{
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-BOD",
    "1": "B-BUILDING",
    "2": "B-CARDISSUER",
    "3": "B-CITY",
    "4": "B-COUNTRY",
    "5": "B-DATE",
    "6": "B-DRIVERLICENSE",
    "7": "B-EMAIL",
    "8": "B-GEOCOORD",
    "9": "B-GIVENNAME1",
    "10": "B-GIVENNAME2",
    "11": "B-IDCARD",
    "12": "B-IP",
    "13": "B-LASTNAME1",
    "14": "B-LASTNAME2",
    "15": "B-LASTNAME3",
    "16": "B-PASS",
    "17": "B-PASSPORT",
    "18": "B-POSTCODE",
    "19": "B-SECADDRESS",
    "20": "B-SEX",
    "21": "B-SOCIALNUMBER",
    "22": "B-STATE",
    "23": "B-STREET",
    "24": "B-TEL",
    "25": "B-TIME",
    "26": "B-TITLE",
    "27": "B-USERNAME",
    "28": "I-BOD",
    "29": "I-BUILDING",
    "30": "I-CARDISSUER",
    "31": "I-CITY",
    "32": "I-COUNTRY",
    "33": "I-DATE",
    "34": "I-DRIVERLICENSE",
    "35": "I-EMAIL",
    "36": "I-GEOCOORD",
    "37": "I-GIVENNAME1",
    "38": "I-GIVENNAME2",
    "39": "I-IDCARD",
    "40": "I-IP",
    "41": "I-LASTNAME1",
    "42": "I-LASTNAME2",
    "43": "I-LASTNAME3",
    "44": "I-PASS",
    "45": "I-PASSPORT",
    "46": "I-POSTCODE",
    "47": "I-SECADDRESS",
    "48": "I-SEX",
    "49": "I-SOCIALNUMBER",
    "50": "I-STATE",
    "51": "I-STREET",
    "52": "I-TEL",
    "53": "I-TIME",
    "54": "I-TITLE",
    "55": "I-USERNAME",
    "56": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-BOD": 0,
    "B-BUILDING": 1,
    "B-CARDISSUER": 2,
    "B-CITY": 3,
    "B-COUNTRY": 4,
    "B-DATE": 5,
    "B-DRIVERLICENSE": 6,
    "B-EMAIL": 7,
    "B-GEOCOORD": 8,
    "B-GIVENNAME1": 9,
    "B-GIVENNAME2": 10,
    "B-IDCARD": 11,
    "B-IP": 12,
    "B-LASTNAME1": 13,
    "B-LASTNAME2": 14,
    "B-LASTNAME3": 15,
    "B-PASS": 16,
    "B-PASSPORT": 17,
    "B-POSTCODE": 18,
    "B-SECADDRESS": 19,
    "B-SEX": 20,
    "B-SOCIALNUMBER": 21,
    "B-STATE": 22,
    "B-STREET": 23,
    "B-TEL": 24,
    "B-TIME": 25,
    "B-TITLE": 26,
    "B-USERNAME": 27,
    "I-BOD": 28,
    "I-BUILDING": 29,
    "I-CARDISSUER": 30,
    "I-CITY": 31,
    "I-COUNTRY": 32,
    "I-DATE": 33,
    "I-DRIVERLICENSE": 34,
    "I-EMAIL": 35,
    "I-GEOCOORD": 36,
    "I-GIVENNAME1": 37,
    "I-GIVENNAME2": 38,
    "I-IDCARD": 39,
    "I-IP": 40,
    "I-LASTNAME1": 41,
    "I-LASTNAME2": 42,
    "I-LASTNAME3": 43,
    "I-PASS": 44,
    "I-PASSPORT": 45,
    "I-POSTCODE": 46,
    "I-SECADDRESS": 47,
    "I-SEX": 48,
    "I-SOCIALNUMBER": 49,
    "I-STATE": 50,
    "I-STREET": 51,
    "I-TEL": 52,
    "I-TIME": 53,
    "I-TITLE": 54,
    "I-USERNAME": 55,
    "O": 56
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
